Thesaru-p/AirTrixx/dist-dashboard-battery/AirTrixx/_internal/firmware/wristband_esp32c3/wristband_esp32c3.ino
#include <Arduino.h>
#include <Wire.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <HTTPUpdate.h>
#include <esp_now.h>
#include <esp_wifi.h>

#if __has_include("../shared/AirTrixxConfig.h")
#include "../shared/AirTrixxConfig.h"
#include "../shared/AirTrixxProtocol.h"
#else
#include "AirTrixxConfig.h"
#include "AirTrixxProtocol.h"
#endif

#define SDA_PIN 8
#define SCL_PIN 9
#define STATUS_LED 4
#define BATTERY_ADC_PIN 1

#define MPU6050_ADDR_PRIMARY 0x68
#define MPU6050_ADDR_SECONDARY 0x69

// Set this to false if your ESP32-C3 SuperMini onboard LED works opposite.
static const bool STATUS_LED_ACTIVE_HIGH = true;
static const float BATTERY_DIVIDER_RATIO = 2.0f;
static const float BATTERY_EMPTY_V = 3.30f;
static const float BATTERY_FULL_V = 4.20f;
static const float BATTERY_LOW_THRESHOLD_V = 3.5f;
static const float BATTERY_LOW_CLEAR_THRESHOLD_V = 3.6f;
static const float BATTERY_SENSE_VALID_MIN_V = 2.0f;
static const uint32_t BATTERY_READ_INTERVAL_MS = 500;
static const uint32_t BATTERY_REPORT_AFTER_CONNECT_MS = 5000;
static const uint32_t BATTERY_REPORT_INTERVAL_MS = 5UL * 60UL * 1000UL;
static const uint32_t STATUS_LED_STARTUP_PULSE_MS = 120;
static const uint32_t STATUS_LED_LOW_BATTERY_INTERVAL_MS = 250;
static const uint32_t STATUS_LED_WAITING_PERIOD_MS = 1000;
static const uint32_t STATUS_LED_WAITING_ON_MS = 80;
static const uint32_t STATUS_LED_SENSOR_FAULT_PERIOD_MS = 2000;
static const uint32_t STATUS_LED_SENSOR_FAULT_PULSE_MS = 120;
static const uint32_t STATUS_LED_SENSOR_FAULT_GAP_MS = 120;
static const uint8_t BATTERY_ADC_SAMPLES = 8;

static bool imuReady = false;
static uint8_t mpu6050Addr = MPU6050_ADDR_PRIMARY;
static uint16_t wristSequence = 0;
static uint32_t lastReportMs = 0;
static uint32_t lastStatusPrintMs = 0;
static uint32_t lastBatteryReadMs = 0;
static uint32_t lastBatteryReportMs = 0;
static uint32_t lastLedBlinkMs = 0;
static uint32_t espNowSendOkCount = 0;
static uint32_t espNowSendFailCount = 0;
static volatile uint32_t espNowDeliveryOkCount = 0;
static volatile uint32_t espNowDeliveryFailCount = 0;
static uint32_t lastSendOkMs = 0;
static uint32_t lastSendFailMs = 0;
static volatile uint32_t lastDeliveryOkMs = 0;
static volatile uint32_t lastDeliveryFailMs = 0;
static bool antennaConnected = false;
static bool batteryLow = false;
static bool batterySenseValid = false;
static bool batteryReportScheduled = false;
static bool ledBlinkOn = false;
static uint32_t nextBatteryReportMs = 0;
static uint16_t batteryAdcRaw = 0;
static float batteryVoltage = 0.0f;
static uint8_t batteryPercent = 0;
static uint32_t imuUpdateOkCount = 0;
static uint32_t imuUpdateMissCount = 0;
static uint32_t otaStartRxCount = 0;
static uint32_t otaFailCount = 0;

static int16_t AccX = 0;
static int16_t AccY = 0;
static int16_t AccZ = 0;
static int16_t GyroX = 0;
static int16_t GyroY = 0;
static int16_t GyroZ = 0;

static float accelOffsetX = 0.0f;
static float accelOffsetY = 0.0f;
static float accelOffsetZ = 0.0f;
static float gyroOffsetX = 0.0f;
static float gyroOffsetY = 0.0f;
static float gyroOffsetZ = 0.0f;

static float accelX = 0.0f;
static float accelY = 0.0f;
static float accelZ = 1.0f;
static float gyroX = 0.0f;
static float gyroY = 0.0f;
static float gyroZ = 0.0f;
static float pitchDeg = 0.0f;
static float rollDeg = 0.0f;

static OtaStartPacket pendingOtaPacket = {};
static bool hasPendingOta = false;
static bool otaInProgress = false;
static portMUX_TYPE otaMux = portMUX_INITIALIZER_UNLOCKED;

// Wristband is not the USB JSON source, so local status logs are safe here.
static const bool STATUS_SERIAL = true;
static const uint32_t STATUS_PRINT_INTERVAL_MS = 2000;
static const float MPU6050_ACCEL_LSB_PER_G = 16384.0f;
static const float MPU6050_GYRO_LSB_PER_DPS = 131.0f;

void debugPrintln(const String &message) {
  if (DEBUG_SERIAL || STATUS_SERIAL) {
    Serial.println(message);
  }
}

void statusPrintln(const String &message) {
  if (STATUS_SERIAL) {
    Serial.println(message);
  }
}

void setStatusLed(bool on) {
  digitalWrite(STATUS_LED, on == STATUS_LED_ACTIVE_HIGH ? HIGH : LOW);
}

void runStatusLedSelfTest() {
  for (uint8_t i = 0; i < 3; ++i) {
    setStatusLed(true);
    delay(STATUS_LED_STARTUP_PULSE_MS);
    setStatusLed(false);
    delay(STATUS_LED_STARTUP_PULSE_MS);
  }
}

bool periodicPulseOn(uint32_t nowMs, uint32_t periodMs, uint32_t onMs) {
  return (nowMs % periodMs) < onMs;
}

bool repeatedPulseOn(uint32_t nowMs,
                     uint32_t periodMs,
                     uint8_t pulseCount,
                     uint32_t pulseMs,
                     uint32_t gapMs) {
  uint32_t phaseMs = nowMs % periodMs;
  for (uint8_t i = 0; i < pulseCount; ++i) {
    uint32_t pulseStartMs = i * (pulseMs + gapMs);
    if (phaseMs >= pulseStartMs && phaseMs < pulseStartMs + pulseMs) {
      return true;
    }
  }
  return false;
}

void refreshAntennaConnectionStatus(uint32_t nowMs) {
  bool connected = lastDeliveryOkMs != 0 &&
                   nowMs - lastDeliveryOkMs <= DEVICE_TIMEOUT_MS;
  if (connected == antennaConnected) {
    return;
  }

  antennaConnected = connected;
  if (antennaConnected) {
    batteryReportScheduled = true;
    nextBatteryReportMs = nowMs + BATTERY_REPORT_AFTER_CONNECT_MS;
    return;
  }

  batteryReportScheduled = false;
  nextBatteryReportMs = 0;
  ledBlinkOn = false;
  setStatusLed(false);
}

uint8_t batteryPercentFromVoltage(float voltage) {
  if (voltage <= BATTERY_EMPTY_V) {
    return 0;
  }
  if (voltage >= BATTERY_FULL_V) {
    return 100;
  }
  return static_cast<uint8_t>(lroundf((voltage - BATTERY_EMPTY_V) * 100.0f /
                                      (BATTERY_FULL_V - BATTERY_EMPTY_V)));
}

void updateBatteryStatus() {
  uint32_t nowMs = millis();
  if (nowMs - lastBatteryReadMs < BATTERY_READ_INTERVAL_MS) {
    return;
  }
  lastBatteryReadMs = nowMs;

  uint32_t rawSum = 0;
  uint32_t mvSum = 0;
  for (uint8_t i = 0; i < BATTERY_ADC_SAMPLES; ++i) {
    rawSum += analogRead(BATTERY_ADC_PIN);
    mvSum += analogReadMilliVolts(BATTERY_ADC_PIN);
    delayMicroseconds(200);
  }

  batteryAdcRaw = rawSum / BATTERY_ADC_SAMPLES;
  float pinVoltage = (static_cast<float>(mvSum) / BATTERY_ADC_SAMPLES) / 1000.0f;
  batteryVoltage = pinVoltage * BATTERY_DIVIDER_RATIO;
  batterySenseValid = batteryVoltage >= BATTERY_SENSE_VALID_MIN_V;
  batteryPercent = batterySenseValid ? batteryPercentFromVoltage(batteryVoltage) : 0;

  if (!batterySenseValid) {
    batteryLow = false;
    return;
  }

  if (batteryLow) {
    batteryLow = batteryVoltage < BATTERY_LOW_CLEAR_THRESHOLD_V;
  } else {
    batteryLow = batteryVoltage < BATTERY_LOW_THRESHOLD_V;
  }
}

void updateStatusLed() {
  uint32_t nowMs = millis();
  refreshAntennaConnectionStatus(nowMs);

  if (batterySenseValid && batteryLow) {
    if (nowMs - lastLedBlinkMs >= STATUS_LED_LOW_BATTERY_INTERVAL_MS) {
      lastLedBlinkMs = nowMs;
      ledBlinkOn = !ledBlinkOn;
      setStatusLed(ledBlinkOn);
    }
    return;
  }

  if (!imuReady) {
    setStatusLed(repeatedPulseOn(nowMs,
                                 STATUS_LED_SENSOR_FAULT_PERIOD_MS,
                                 3,
                                 STATUS_LED_SENSOR_FAULT_PULSE_MS,
                                 STATUS_LED_SENSOR_FAULT_GAP_MS));
    return;
  }

  if (!antennaConnected) {
    setStatusLed(periodicPulseOn(nowMs,
                                 STATUS_LED_WAITING_PERIOD_MS,
                                 STATUS_LED_WAITING_ON_MS));
    return;
  }

  ledBlinkOn = true;
  setStatusLed(true);
}

void printMacAddress(const uint8_t mac[6]) {
  for (int i = 0; i < 6; ++i) {
    if (i > 0) {
      Serial.print(":");
    }
    if (mac[i] < 0x10) {
      Serial.print("0");
    }
    Serial.print(mac[i], HEX);
  }
}

void printWiFiStatus() {
  if (!STATUS_SERIAL) {
    return;
  }

