Thesaru-p/AirTrixx/dist-dashboard-battery/AirTrixx/_internal/firmware/wristband_esp32c3/wristband_esp32c3.ino
  uint8_t mac[6] = {};
  WiFi.macAddress(mac);
  uint8_t primaryChannel = 0;
  wifi_second_chan_t secondChannel = WIFI_SECOND_CHAN_NONE;
  esp_err_t channelResult = esp_wifi_get_channel(&primaryChannel, &secondChannel);

  Serial.print("[WRISTBAND] WiFi mode STA, MAC=");
  printMacAddress(mac);
  Serial.print(", configured_channel=");
  Serial.print(ESPNOW_CHANNEL);
  Serial.print(", active_channel=");
  if (channelResult == ESP_OK) {
    Serial.print(primaryChannel);
  } else {
    Serial.print("unknown err=");
    Serial.print(channelResult);
  }
  Serial.print(", power_save=off");
  Serial.println();
}

void configureWiFiChannel() {
  statusPrintln("[WRISTBAND] Turning WiFi on in STA mode...");
  
  // CRITICAL FIXES FOR DEFECTIVE SUPERMINI ANTENNA MATCHING
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false); // Force RF synthesizer to stay fully awake & stable
  WiFi.disconnect();
  
  // Drop transmission power limit down to safe threshold to avoid self-blinding reflections (VSWR)
  WiFi.setTxPower(WIFI_POWER_8_5dBm); 
  
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);
  printWiFiStatus();
}

bool addEspNowPeer(const uint8_t mac[6]) {
  if (esp_now_is_peer_exist(mac)) {
    statusPrintln("[WRISTBAND] ESP-NOW antenna peer already exists.");
    return true;
  }

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = ESPNOW_CHANNEL;
  peer.encrypt = false;
  peer.ifidx = WIFI_IF_STA;
  esp_err_t result = esp_now_add_peer(&peer);
  if (result != ESP_OK) {
    statusPrintln("[WRISTBAND] ESP-NOW add antenna peer failed, err=" + String(result));
    return false;
  }
  statusPrintln("[WRISTBAND] ESP-NOW antenna peer added.");
  return true;
}

void handleIncomingPacket(const uint8_t *data, int len) {
  if (len != static_cast<int>(sizeof(OtaStartPacket))) {
    return;
  }

  OtaStartPacket packet = {};
  memcpy(&packet, data, sizeof(packet));
  if (packet.header.protocol_version != AIRTRIXX_PROTOCOL_VERSION ||
      packet.header.msg_type != MSG_OTA_START ||
      packet.header.device_id != DEVICE_ANTENNA) {
    return;
  }

  packet.ssid[AIRTRIXX_OTA_SSID_MAX] = '\0';
  packet.password[AIRTRIXX_OTA_PASSWORD_MAX] = '\0';
  packet.url[AIRTRIXX_OTA_URL_MAX] = '\0';
  packet.md5[AIRTRIXX_OTA_MD5_MAX] = '\0';

  portENTER_CRITICAL(&otaMux);
  pendingOtaPacket = packet;
  hasPendingOta = true;
  otaStartRxCount++;
  portEXIT_CRITICAL(&otaMux);
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
  (void)info;
  handleIncomingPacket(incomingData, len);
}
#else
void onEspNowDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
  (void)mac;
  handleIncomingPacket(incomingData, len);
}
#endif

void handleEspNowSendResult(esp_now_send_status_t status) {
  uint32_t nowMs = millis();
  if (status == ESP_NOW_SEND_SUCCESS) {
    espNowDeliveryOkCount++;
    lastDeliveryOkMs = nowMs;
  } else {
    espNowDeliveryFailCount++;
    lastDeliveryFailMs = nowMs;
  }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowDataSent(const wifi_tx_info_t *info, esp_now_send_status_t status) {
  (void)info;
  handleEspNowSendResult(status);
}
#else
void onEspNowDataSent(const uint8_t *mac, esp_now_send_status_t status) {
  (void)mac;
  handleEspNowSendResult(status);
}
#endif

int16_t clampInt16(long value) {
  if (value > 32767) {
    return 32767;
  }
  if (value < -32768) {
    return -32768;
  }
  return static_cast<int16_t>(value);
}

int32_t clampInt32(double value) {
  if (value > 2147483647.0) {
    return 2147483647;
  }
  if (value < -2147483648.0) {
    return -2147483647 - 1;
  }
  return static_cast<int32_t>(lround(value));
}

bool writeI2CRegister(uint8_t address, uint8_t reg, uint8_t value) {
  Wire.beginTransmission(address);
  Wire.write(reg);
  Wire.write(value);
  return Wire.endTransmission(true) == 0;
}

float rawAccelToG(int16_t rawValue) {
  return static_cast<float>(rawValue) / MPU6050_ACCEL_LSB_PER_G;
}

float rawGyroToDps(int16_t rawValue) {
  return static_cast<float>(rawValue) / MPU6050_GYRO_LSB_PER_DPS;
}

bool initMPU6050At(uint8_t address) {
  bool ok = writeI2CRegister(address, 0x6B, 0x00);  // Wake up MPU6050.
  delay(100);

  if (ok) {
    ok = writeI2CRegister(address, 0x1C, 0x00) &&  // Accelerometer +/-2g.
         writeI2CRegister(address, 0x1B, 0x00);    // Gyro +/-250 dps.
  }

  return ok;
}

bool initMPU6050() {
  bool ok = initMPU6050At(MPU6050_ADDR_PRIMARY);
  if (ok) {
    mpu6050Addr = MPU6050_ADDR_PRIMARY;
  } else {
    ok = initMPU6050At(MPU6050_ADDR_SECONDARY);
    if (ok) {
      mpu6050Addr = MPU6050_ADDR_SECONDARY;
    }
  }

  if (ok) {
    statusPrintln("[WRISTBAND] MPU6050 Ready at 0x" + String(mpu6050Addr, HEX));
  } else {
    statusPrintln("[WRISTBAND] MPU6050 Not Found at 0x68 or 0x69");
  }

  delay(100);
  return ok;
}

bool readMPU6050() {
  Wire.beginTransmission(mpu6050Addr);
  Wire.write(0x3B);
  if (Wire.endTransmission(false) != 0) {
    return false;
  }

  size_t bytesRead = Wire.requestFrom(static_cast<uint8_t>(mpu6050Addr),
                                      static_cast<size_t>(14),
                                      true);
  if (bytesRead < 14 || Wire.available() < 14) {
    return false;
  }

  AccX = Wire.read() << 8 | Wire.read();
  AccY = Wire.read() << 8 | Wire.read();
  AccZ = Wire.read() << 8 | Wire.read();

  Wire.read();
  Wire.read();

  GyroX = Wire.read() << 8 | Wire.read();
  GyroY = Wire.read() << 8 | Wire.read();
  GyroZ = Wire.read() << 8 | Wire.read();
  return true;
}

void calibrateIMU() {
  statusPrintln("[WRISTBAND] Keep wristband still for 2 seconds for IMU calibration...");

  double sumAx = 0.0;
  double sumAy = 0.0;
  double sumAz = 0.0;
  double sumGx = 0.0;
  double sumGy = 0.0;
  double sumGz = 0.0;
  uint16_t count = 0;
  uint32_t startMs = millis();

  while (millis() - startMs < 2000) {
    if (readMPU6050()) {
      sumAx += rawAccelToG(AccX);
      sumAy += rawAccelToG(AccY);
      sumAz += rawAccelToG(AccZ);
      sumGx += rawGyroToDps(GyroX);
      sumGy += rawGyroToDps(GyroY);
      sumGz += rawGyroToDps(GyroZ);
      count++;
    }
    delay(5);
  }

