Thesaru-p/AirTrixx/dist-dashboard-battery/AirTrixx/_internal/firmware/wristband_esp32c3/wristband_esp32c3.ino
  if (count == 0) {
    statusPrintln("[WRISTBAND] IMU calibration skipped; no samples.");
    return;
  }

  float avgAx = sumAx / count;
  float avgAy = sumAy / count;
  float avgAz = sumAz / count;

  accelOffsetX = avgAx;
  accelOffsetY = avgAy;
  // Preserve the gravity component on Z instead of subtracting it away.
  accelOffsetZ = avgAz - (avgAz >= 0.0f ? 1.0f : -1.0f);
  gyroOffsetX = sumGx / count;
  gyroOffsetY = sumGy / count;
  gyroOffsetZ = sumGz / count;

  statusPrintln("[WRISTBAND] IMU calibration complete, samples=" + String(count));
  statusPrintln("[WRISTBAND] accel offsets g x/y/z=" + String(accelOffsetX, 4) +
                "/" + String(accelOffsetY, 4) + "/" + String(accelOffsetZ, 4));
  statusPrintln("[WRISTBAND] gyro offsets dps x/y/z=" + String(gyroOffsetX, 4) +
                "/" + String(gyroOffsetY, 4) + "/" + String(gyroOffsetZ, 4));
}

void updateIMU() {
  if (!imuReady) {
    imuUpdateMissCount++;
    return;
  }
  if (!readMPU6050()) {
    imuUpdateMissCount++;
    return;
  }
  imuUpdateOkCount++;

  accelX = rawAccelToG(AccX) - accelOffsetX;
  accelY = rawAccelToG(AccY) - accelOffsetY;
  accelZ = rawAccelToG(AccZ) - accelOffsetZ;
  gyroX = rawGyroToDps(GyroX) - gyroOffsetX;
  gyroY = rawGyroToDps(GyroY) - gyroOffsetY;
  gyroZ = rawGyroToDps(GyroZ) - gyroOffsetZ;

  pitchDeg = atan2f(-accelX, sqrtf(accelY * accelY + accelZ * accelZ)) * 180.0f / PI;
  rollDeg = atan2f(accelY, accelZ) * 180.0f / PI;
}

void sendPacketToAntenna(const uint8_t *data, size_t len, const char *label) {
  // Terminate I2C while ESP-NOW transmits to reduce RF/I2C trace coupling.
  Wire.end();
  pinMode(SDA_PIN, INPUT);
  pinMode(SCL_PIN, INPUT);

  esp_err_t result = esp_now_send(ANTENNA_MAC_PLACEHOLDER, data, len);
  if (result != ESP_OK) {
    espNowSendFailCount++;
    lastSendFailMs = millis();
    statusPrintln("[WRISTBAND] ESP-NOW " + String(label) + " send failed, err=" + String(result));
  } else {
    espNowSendOkCount++;
    lastSendOkMs = millis();
  }

  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);
}

void sendWristbandData() {
  WristbandDataPacket packet = {};
  fillHeader(packet.header,
             MSG_WRISTBAND_DATA,
             DEVICE_WRISTBAND,
             ++wristSequence,
             millis(),
             false);

  packet.accel_mg_x = clampInt16(lround(accelX * 1000.0f));
  packet.accel_mg_y = clampInt16(lround(accelY * 1000.0f));
  packet.accel_mg_z = clampInt16(lround(accelZ * 1000.0f));
  packet.gyro_mdps_x = clampInt32(gyroX * 1000.0);
  packet.gyro_mdps_y = clampInt32(gyroY * 1000.0);
  packet.gyro_mdps_z = clampInt32(gyroZ * 1000.0);
  packet.pitch_cdeg = clampInt16(lround(pitchDeg * 100.0f));
  packet.roll_cdeg = clampInt16(lround(rollDeg * 100.0f));

  sendPacketToAntenna(reinterpret_cast<const uint8_t *>(&packet),
                      sizeof(packet),
                      "wristband data");
}

void sendBatteryStatus() {
  BatteryStatusPacket packet = {};
  fillHeader(packet.header,
             MSG_BATTERY_STATUS,
             DEVICE_WRISTBAND,
             ++wristSequence,
             millis(),
             false);
  packet.battery_mv = batterySenseValid ? static_cast<uint16_t>(lroundf(batteryVoltage * 1000.0f)) : 0;
  packet.battery_percent = batterySenseValid ? batteryPercent : 0;
  packet.battery_valid = batterySenseValid ? 1 : 0;
  packet.battery_adc_raw = batteryAdcRaw;

  sendPacketToAntenna(reinterpret_cast<const uint8_t *>(&packet),
                      sizeof(packet),
                      "battery status");
}

void maybeSendBatteryStatus() {
  if (lastBatteryReadMs == 0 || !antennaConnected || !batteryReportScheduled) {
    return;
  }

  uint32_t nowMs = millis();
  if (static_cast<int32_t>(nowMs - nextBatteryReportMs) >= 0) {
    lastBatteryReportMs = nowMs;
    nextBatteryReportMs = nowMs + BATTERY_REPORT_INTERVAL_MS;
    sendBatteryStatus();
  }
}

bool initializeEspNowStack() {
  if (esp_now_init() != ESP_OK) {
    statusPrintln("[WRISTBAND] ESP-NOW init failed.");
    return false;
  }
  statusPrintln("[WRISTBAND] ESP-NOW init ok.");
  esp_now_register_send_cb(onEspNowDataSent);
  esp_now_register_recv_cb(onEspNowDataRecv);
  addEspNowPeer(ANTENNA_MAC_PLACEHOLDER);
  return true;
}

void restoreEspNowAfterOtaFailure() {
  WiFi.disconnect(true);
  delay(100);
  configureWiFiChannel();
  initializeEspNowStack();
  antennaConnected = false;
  batteryReportScheduled = false;
  nextBatteryReportMs = 0;
}

void blinkOtaLed(uint32_t nowMs) {
  setStatusLed((nowMs / 100) % 2 == 0);
}

void performOtaUpdate(const OtaStartPacket &packet) {
  otaInProgress = true;
  statusPrintln("[WRISTBAND] OTA requested, url=" + String(packet.url));

  esp_now_deinit();
  Wire.end();
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.disconnect(true);
  delay(100);
  WiFi.begin(packet.ssid, packet.password);

  uint32_t startMs = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startMs < 60000UL) {
    blinkOtaLed(millis());
    delay(50);
  }

  if (WiFi.status() != WL_CONNECTED) {
    otaFailCount++;
    statusPrintln("[WRISTBAND] OTA WiFi connect failed.");
    Wire.begin(SDA_PIN, SCL_PIN);
    Wire.setClock(400000);
    restoreEspNowAfterOtaFailure();
    otaInProgress = false;
    return;
  }

  statusPrintln("[WRISTBAND] OTA WiFi connected, IP=" + WiFi.localIP().toString());
  WiFiClient client;
  httpUpdate.rebootOnUpdate(true);
  httpUpdate.onProgress([](int current, int total) {
    static uint32_t lastProgressMs = 0;
    uint32_t nowMs = millis();
    if (nowMs - lastProgressMs >= 500) {
      lastProgressMs = nowMs;
      blinkOtaLed(nowMs);
      if (total > 0) {
        statusPrintln("[WRISTBAND] OTA progress " + String((current * 100) / total) + "%");
      }
    }
  });

  t_httpUpdate_return result = httpUpdate.update(client, String(packet.url));
  if (result == HTTP_UPDATE_OK) {
    statusPrintln("[WRISTBAND] OTA update ok; rebooting.");
    delay(100);
    ESP.restart();
  }

  otaFailCount++;
  statusPrintln("[WRISTBAND] OTA update failed, err=" +
                String(httpUpdate.getLastError()) + " " +
                httpUpdate.getLastErrorString());
  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);
  restoreEspNowAfterOtaFailure();
  otaInProgress = false;
}

