Thesaru-p/AirTrixx/dist-dashboard-battery/AirTrixx/_internal/firmware/wristband_esp32c3/wristband_esp32c3.ino
void processPendingOta() {
  if (otaInProgress) {
    return;
  }

  OtaStartPacket packet = {};
  bool shouldStart = false;
  portENTER_CRITICAL(&otaMux);
  if (hasPendingOta) {
    packet = pendingOtaPacket;
    hasPendingOta = false;
    shouldStart = true;
  }
  portEXIT_CRITICAL(&otaMux);

  if (shouldStart) {
    performOtaUpdate(packet);
  }
}

void setup() {
  pinMode(STATUS_LED, OUTPUT);
  setStatusLed(false);
  runStatusLedSelfTest();
  pinMode(BATTERY_ADC_PIN, INPUT);
  analogReadResolution(12);
  analogSetPinAttenuation(BATTERY_ADC_PIN, ADC_11db);

  Serial.begin(AIRTRIXX_SERIAL_BAUD);
  delay(200);
  statusPrintln("");
  statusPrintln("[WRISTBAND] AirTrixx Wristband ESP32-C3 booting...");
  statusPrintln("[WRISTBAND] Serial baud=" + String(AIRTRIXX_SERIAL_BAUD));

  statusPrintln("[WRISTBAND] Starting sensor I2C: SDA=" + String(SDA_PIN) +
                " SCL=" + String(SCL_PIN) + ", MPU6050=0x68/0x69");
  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);

  imuReady = initMPU6050();

  if (imuReady) {
    calibrateIMU();
  } else {
    statusPrintln("[WRISTBAND] IMU calibration skipped; MPU6050 is not ready.");
  }

  configureWiFiChannel();
  if (!initializeEspNowStack()) {
    return;
  }
  statusPrintln("[WRISTBAND] Setup complete.");
}

void printConnectionStatus() {
  if (!STATUS_SERIAL) {
    return;
  }

  uint32_t nowMs = millis();
  Serial.print("[WRISTBAND] status t=");
  Serial.print(nowMs);
  Serial.print("ms, imu=");
  Serial.print(imuReady ? "ok" : "not_ready");
  Serial.print(", imu_addr=0x");
  Serial.print(mpu6050Addr, HEX);
  Serial.print(", peer=");
  Serial.print(esp_now_is_peer_exist(ANTENNA_MAC_PLACEHOLDER) ? "yes" : "no");
  Serial.print(", send_ok=");
  Serial.print(espNowSendOkCount);
  Serial.print(", send_fail=");
  Serial.print(espNowSendFailCount);
  Serial.print(", delivery_ok=");
  Serial.print(espNowDeliveryOkCount);
  Serial.print(", delivery_fail=");
  Serial.print(espNowDeliveryFailCount);
  Serial.print(", antenna_connected=");
  Serial.print(antennaConnected ? "yes" : "no");
  Serial.print(", battery_v=");
  Serial.print(batteryVoltage, 3);
  Serial.print(", battery_pct=");
  Serial.print(batterySenseValid ? static_cast<int>(batteryPercent) : -1);
  Serial.print(", battery_low=");
  Serial.print(batteryLow ? "yes" : "no");
  Serial.print(", battery_sense=");
  Serial.print(batterySenseValid ? "valid" : "invalid");
  Serial.print(", battery_adc=");
  Serial.print(batteryAdcRaw);
  Serial.print(", battery_next_report_age_ms=");
  if (!batteryReportScheduled) {
    Serial.print(-1);
  } else {
    Serial.print(static_cast<int32_t>(nowMs - nextBatteryReportMs));
  }
  Serial.print(", last_send_ok_age_ms=");
  Serial.print(lastSendOkMs == 0 ? -1 : static_cast<int32_t>(nowMs - lastSendOkMs));
  Serial.print(", last_send_fail_age_ms=");
  Serial.print(lastSendFailMs == 0 ? -1 : static_cast<int32_t>(nowMs - lastSendFailMs));
  Serial.print(", last_delivery_ok_age_ms=");
  Serial.print(lastDeliveryOkMs == 0 ? -1 : static_cast<int32_t>(nowMs - lastDeliveryOkMs));
  Serial.print(", last_delivery_fail_age_ms=");
  Serial.print(lastDeliveryFailMs == 0 ? -1 : static_cast<int32_t>(nowMs - lastDeliveryFailMs));
  Serial.print(", seq=");
  Serial.print(wristSequence);
  Serial.print(", imu_updates ok/miss=");
  Serial.print(imuUpdateOkCount);
  Serial.print("/");
  Serial.print(imuUpdateMissCount);
  Serial.print(", ota_rx/fail=");
  Serial.print(otaStartRxCount);
  Serial.print("/");
  Serial.print(otaFailCount);
  Serial.print(", raw_acc x/y/z=");
  Serial.print(AccX);
  Serial.print("/");
  Serial.print(AccY);
  Serial.print("/");
  Serial.print(AccZ);
  Serial.print(", raw_gyro x/y/z=");
  Serial.print(GyroX);
  Serial.print("/");
  Serial.print(GyroY);
  Serial.print("/");
  Serial.print(GyroZ);
  Serial.print(", accel_g x/y/z=");
  Serial.print(accelX, 3);
  Serial.print("/");
  Serial.print(accelY, 3);
  Serial.print("/");
  Serial.print(accelZ, 3);
  Serial.print(", gyro_dps x/y/z=");
  Serial.print(gyroX, 2);
  Serial.print("/");
  Serial.print(gyroY, 2);
  Serial.print("/");
  Serial.print(gyroZ, 2);
  Serial.print(", pitch/roll=");
  Serial.print(pitchDeg, 1);
  Serial.print("/");
  Serial.println(rollDeg, 1);
}

void loop() {
  processPendingOta();
  if (otaInProgress) {
    return;
  }

  updateIMU();
  updateBatteryStatus();

  uint32_t nowMs = millis();
  const uint32_t intervalMs = 1000UL / WRISTBAND_REPORT_HZ;
  if (nowMs - lastReportMs >= intervalMs) {
    lastReportMs = nowMs;
    sendWristbandData();
  }
  refreshAntennaConnectionStatus(nowMs);
  maybeSendBatteryStatus();

  updateStatusLed();

  if (nowMs - lastStatusPrintMs >= STATUS_PRINT_INTERVAL_MS) {
    lastStatusPrintMs = nowMs;
    printConnectionStatus();
  }
}
